'''
Created on 2016/10/18

@author: FORBiS01
'''
##########################################################
print('〓〓〓〓数値〓〓〓〓')
# 複素数型などの型も
##########################################################
x=1+2
print(x)
#指数
print(2**3)

#乱数の生成
import random
print( random.random() )

#数学
import math
print( math.pi )

##########################################################
print('〓〓〓〓文字列〓〓〓〓')
#  [']または["]によって記述. バックスラッシュでエスケープ
##########################################################
str1 = 'tes\'t'
print( str1 )

#複数行[''']または["""]
str2 = '''len1
len2'''
print( str2 )

#結合
str3 = str1 + ':' + str1
print( str3 )
print( str1*2 )

#インデントアクセス
print( str1[1] )
#終端からインデントアクセス
print( str1[-1] )


##########################################################
print('〓〓〓〓リスト〓〓〓〓')
##########################################################
#リスト内の任意の値をランダムに取得
import random
L1=[1,2,3,4,5]
print( random.choice(L1) )